In [2]:
import pandas as pd

In [3]:
data = pd.read_csv('hiring.csv')
data.head()

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000

In [4]:
data.columns

Index(['experience', 'test_score(out of 10)', 'interview_score(out of 10)',
       'salary($)'],
      dtype='object')

In [5]:
data.rename({'experience':'experience', 'test_score(out of 10)':'test_score','interview_score(out of 10)':'interview_score','salary($)':'salary'},axis=1,inplace=True)
data.head()

  experience  test_score  interview_score  salary
0        NaN         8.0                9   50000
1        NaN         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000

In [6]:
def convert_to_int(word):
    word_dict = {'one':1, 'two':2, 'three':3, 'four':4, 'five':5, 'six':6, 'seven':7, 'eight':8,
                'nine':9, 'ten':10, 'eleven':11, 'twelve':12, 'zero':0, 0: 0}
    return word_dict[word]

In [10]:
word = [{'one':1, 'two':2, 'three':3, 'four':4, 'five':5, 'six':6, 'seven':7, 'eight':8,
                'nine':9, 'ten':10, 'eleven':11, 'twelve':12, 'zero':0, 0: 0}]

In [11]:
convert_to_int(word)

TypeError: unhashable type: 'list'

In [12]:
X = data.iloc[:, :3]

In [13]:
X

  experience  test_score  interview_score
0        NaN         8.0                9
1        NaN         8.0                6
2       five         6.0                7
3        two        10.0               10
4      seven         9.0                6
5      three         7.0               10
6        ten         NaN                7
7     eleven         7.0                8